/**
 * @mainpage
 * # Загальне завдання
 * Переробити програми, що були розроблені під час виконання лабораторних робіт з тем
 * “Масиви” та “Цикли” таким чином, щоб використовувалися функції для обчислення результату.
 * Функції повинні задовольняти основну їх причетність - уникати дублювання коду. Тому,
 * для демонстрації роботи, ваша програма (функція main()) повинна мати можливість викликати
 * розроблену функцію з різними вхідними даними.
 *
 * @file main.c
 * @brief Файл з основним кодом.
 *
 * @author Pustovy I.
 * @date 26-apr-2022
 * @version 1.0
 */
#include "lib.h"
#include <stdlib.h>
#include <stdio.h>
int main() {
    printf("P.s. Якщо число не просте, результат дорівнює нулю \n");
    int x;
    printf("Введіть число ");
    scanf("%d", &x);
    x = func(x);
    printf("Результат = %d", x);
    return 0;
}
