//  Визначити, чи є ціле 6-значне число “щасливим” квитком (“щасливий квиток” – квиток, в якому сума першої половини чисел номера дорівнює сумі другої половини. //
int main() {
	int x = 302300;
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	int j = 0;
	int sum1 = 0;
	int sum2 = 0;
	a = x / 100000;
	b = x / 10000 % 10;
	c = x / 1000 % 10;
	d = x / 100 % 10;
	e = x / 10 % 10;
	j = x % 10;
	sum1 = a + b + c;
	sum2 = d + e + j;
	if ( sum1 == sum2 ) {
		x = 1;
	}
	else {
		x = 0;
	}

	return 0;
}
